-- 1. Выведите все товары из таблицы products, относящиеся к категории «Электроника».
SELECT * FROM products WHERE category = 'Электроника';

-- 2. Выведите товары из категории «Одежда», у которых в названии есть слово «женские».
SELECT * FROM products WHERE category = 'Одежда' AND name LIKE '%женские%';

-- 3. Выведите товары, которые относятся к категории «Продукты» или «Книги».
SELECT * FROM products WHERE category = 'Продукты' OR category = 'Книги';

-- 4. Выведите все товары, которые не относятся к категории «Бытовая техника».
SELECT * FROM products WHERE NOT category = 'Бытовая техника';

-- 5. Выведите товары, которые относятся к одной из категорий: «Электроника», «Одежда», «Книги».
SELECT * FROM products WHERE category IN ('Электроника', 'Одежда', 'Книги');

-- 6. Выведите товары, которые: относятся к категории «Электроника» и при этом их название содержит «Samsung»; или относятся к категории «Бытовая техника».
SELECT * FROM products WHERE (category = 'Электроника' AND name LIKE '%Samsung%') OR category = 'Бытовая техника';

-- 7. Выведите товары, которые: относятся к одной из категорий: «Электроника», «Одежда», «Бытовая техника» и их id находится в диапазоне от 1 до 15 и название не содержит слово «Samsung»; или относятся к категории «Книги».
SELECT * FROM products 
WHERE (
    category IN ('Электроника', 'Одежда', 'Бытовая техника') 
    AND product_id BETWEEN 1 AND 15 
    AND name NOT LIKE '%Samsung%'
) OR category = 'Книги';